# TPS-YOLO11n with FGDC neck detail-compensation blocks.
#
# This YAML is intentionally scoped to the YOLO11n channel layout. The FGDC
# blocks preserve feature shapes and are inserted on the P3/P4/P5 neck outputs
# used by Detect.

nc: 8

backbone:
  - [-1, 1, Conv, [16, 3, 2]]
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, C3k2, [64, False, 0.25]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, C3k2, [128, False, 0.25]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, C3k2, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C3k2, [256, True]]
  - [-1, 1, SPPF, [256, 5]]
  - [-1, 1, C2PSA, [256]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [128, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C3k2, [64, False]]
  - [-1, 1, FGDC, [64]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, C3k2, [128, False]]
  - [-1, 1, FGDC, [128]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [256, True]]
  - [-1, 1, FGDC, [256]]
  - [[17, 21, 25], 1, Detect, [nc]]
